resources/wsdl/DriverProfileRequest.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="urn:magic.HITESHB-PC.DriverProfileRequest"
             xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
             xmlns:tns="urn:magic.HITESHB-PC.DriverProfileRequest"
             xmlns:xsdin22="DriverProfileRequest"
             xmlns:xsdout22="DriverProfileResposne"
>

<documentation>
WSDL Builder (Magic eDeveloper v9.4)
Created By   : HITESH---HITESH
Created Date : 01/08/2017 Time :18:14:28
Application   : Import Process
</documentation>

<import  namespace="DriverProfileRequest" location="d:\Magic\Dev940\Scripts\WSDL\DriverProfileRequest.xsd"/>
<import  namespace="DriverProfileResposne" location="d:\Magic\Dev940\Scripts\WSDL\DriverProfileResponse.xsd"/>

 
<message name="LoadDriverProfileWS">
   <part name="PI_In_Blob_1" element="xsdin22:DriverProfileRQ" />
</message>
<message name="LoadDriverProfileWSResponse">
   <part name="LoadDriverProfileWS_Ret"  element="xsdout22:DriverProfileRS" />
</message>

<portType name="DriverProfileRequestPortType">
         <operation name="LoadDriverProfileWS" >
         <input message="tns:LoadDriverProfileWS" />
         <output message="tns:LoadDriverProfileWSResponse"/>
      </operation>
</portType>

<binding name="DriverProfileRequestBinding"
   type="tns:DriverProfileRequestPortType">
   <soap:binding  transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
         <operation name="LoadDriverProfileWS">
         <documentation></documentation>
         <soap:operation soapAction="357556C69666F627052756679627444616F6C4F237375636F62705024727F607D694A336F646" />
         <input>
            <soap:body use="literal" />
            
         </input>
         <output>
            <soap:body use="literal" />
         </output>
      </operation>
</binding>
<service name="DriverProfileRequest">
   <documentation></documentation>
   <port name="DriverProfileRequestPortType" binding="tns:DriverProfileRequestBinding">
      <soap:address location="http://HITESHB-PC/Magic94Scripts/mgrqispi94.dll" />
   </port>
</service>
</definitions>
